﻿// //Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
 int a =7;
 int b = 9;
 if(b > a)
   Console.WriteLine("b больше");
 else
   Console.WriteLine("a больше");